let marzer = [
    {
        id:1,
        name: "Արագածոտն",
        informate: {
            territory: "2600 ք/մ",
            agricultrual_land: "2100 հեկտար",
            total_population: "315742",
            urban: "23555 (39%)",
            rural: "15855 (30%)",
            total_workforce: "19855 (20%)",
            employed: "1955 (50%)",
            average_salary: "1 Հայկական Դրամ",
            specialization: "Արդյունաբերություն",
            success_case: "Անասնապահություն",
        },
        main_part: {
            weather: "Բարենպաստ կլիմա",
            region_center_title: "Աշտարակ",
            average_prices: "Միջին գիները մատչելի են",
            Georgia: "19 կմ",
            Yerevan: "120 կմ",
            Iran: "200 կմ",
        },
        class_name:"aragacotn",
        img:"aragacotn.png",
        img_active:"aragacotn-active.png",
        coords:"56,149,83,150,85,138,93,139,105,147,113,147,121,154,128,153,136,158,147,156,155,158,155,152,163,147,183,146,185,155,195,160,193,173,199,177,216,169,227,169,234,160,256,152,266,140,257,133,252,126,252,118,257,113,260,103,260,94,254,92,244,90,233,90,232,80,226,69,220,66,220,55,228,48,235,42,239,36,241,27,247,23,251,9,259,6,268,7,271,16,284,21,293,21,299,11,309,8,322,11,332,17,339,15,347,20,358,24,367,36,365,51,370,64,367,75,381,82,384,92,395,98,407,96,423,99,427,109,427,127,420,131,420,137,420,146,412,152,412,169,408,187,412,193,412,200,405,207,395,211,388,219,381,230,379,238,380,250,372,252,363,253,360,270,370,270,377,277,380,284,377,290,370,297,366,303,368,316,364,325,355,321,339,320,333,309,322,300,309,300,304,284,298,286,288,285,284,294,277,298,266,297,257,290,249,288,252,301,251,314,249,321,253,329,242,333,227,329,215,328,204,331,194,329,182,332,169,333,161,324,151,312,140,305,133,295,127,283,117,282,103,281,96,277,95,289,86,294,77,292,71,281,65,272,61,279,55,284,49,290,40,285,30,281,24,271,18,260,10,248,8,237,10,220,18,209,17,199,26,194,27,181,39,179,50,178,48,165,50,155",
    },
    {
        id:2,
        name: "Արարատ",
        informate: {
            territory: "2096 ք/մ",
            agricultrual_land: "1800 հեկտար",
            total_population: "250000",
            urban: "150000 (60%)",
            rural: "100000 (40%)",
            total_workforce: "150000 (60%)",
            employed: "90000 (60%)",
            average_salary: "180000 Դրամ",
            specialization: "Գյուղատնտեսություն",
            success_case: "Ագրոտուրիզմ",
        },
        main_part: {
            weather: "Չոր կլիմա",
            region_center_title: "Արտաշատ",
            average_prices: "Հողամասեր մատչելի են",
            Georgia: "150 կմ",
            Yerevan: "50 կմ",
            Iran: "300 կմ",
        },
        class_name:"ararat",
        img:"ararat.png",
        img_active:"ararat-active.png",
        coords:"28,18,40,18,55,10,61,12,59,23,62,34,74,38,85,47,93,55,105,50,116,46,125,34,136,24,147,26,149,42,161,44,179,42,192,37,212,34,232,20,253,11,276,6,294,2,307,3,318,8,327,15,327,27,327,36,331,43,331,50,334,65,342,72,348,74,350,83,364,91,364,214,353,220,349,231,343,232,337,236,331,245,320,251,314,259,304,264,293,270,258,270,252,266,245,266,234,270,173,270,167,255,156,241,144,232,135,227,120,214,112,201,107,190,101,172,99,158,94,149,85,143,81,131,76,120,63,121,60,114,54,109,46,102,30,99,19,93,15,78,16,64,9,50,4,46,4,33,18,28"
    },
    {
        id:3,
        name: "Արմավիր",
        informate: {
            territory: "1242 ք/մ",
            agricultrual_land: "1500 հեկտար",
            total_population: "265000",
            urban: "135000 (51%)",
            rural: "130000 (49%)",
            total_workforce: "175000 (66%)",
            employed: "95000 (54%)",
            average_salary: "200000 Դրամ",
            specialization: "Արդյունաբերություն",
            success_case: "Գյուղատնտեսություն",
        },
        main_part: {
            weather: "Բարենպաստ կլիմա",
            region_center_title: "Վաղարշապատ",
            average_prices: "Միջին գիները մատչելի են",
            Georgia: "130 կմ",
            Yerevan: "45 կմ",
            Iran: "250 կմ",
        },
        class_name:"armavir",
        img:"armavir.png",
        img_active:"armavir-active.png",
        coords:"263,14,272,15,286,14,293,17,296,23,306,26,312,29,318,35,323,39,331,41,338,42,346,45,346,105,339,101,333,101,327,104,319,107,316,113,321,123,324,137,324,150,322,161,316,162,310,163,299,163,294,162,289,159,283,158,272,158,262,161,257,162,245,163,231,163,216,163,197,163,180,163,163,163,128,163,101,163,87,156,68,146,57,137,43,134,26,132,16,122,7,115,2,105,4,89,9,77,22,74,33,73,29,67,24,56,16,51,9,41,15,36,19,29,23,21,31,14,37,3,46,7,54,17,57,23,65,21,66,6,79,10,89,11,102,10,109,20,118,32,129,41,138,52,148,61,158,61,172,60,183,58,196,58,208,59,222,61,224,52,226,41,224,29,221,17,230,16,236,23,245,29,254,30,257,21",
    },
    {
        id:4,
        name: "Գեղարքունիք",
        informate: {
            territory: "5348 ք/մ",
            agricultrual_land: "2800 հեկտար",
            total_population: "235000",
            urban: "90000 (38%)",
            rural: "145000 (62%)",
            total_workforce: "120000 (51%)",
            employed: "70000 (58%)",
            average_salary: "150000 Դրամ",
            specialization: "Ձկնաբուծություն",
            success_case: "Զբոսաշրջություն",
        },
        main_part: {
            weather: "Ջերմային կլիմա",
            region_center_title: "Գավառ",
            average_prices: "Հողամասեր մատչելի են",
            Georgia: "200 կմ",
            Yerevan: "90 կմ",
            Iran: "400 կմ",
        },
        class_name:"gegharquniq",
        img:"gegharquniq.png",
        img_active:"gegharquniq-active.png",
        coords:"3,72,10,69,10,57,17,49,27,57,33,54,38,46,49,48,56,40,64,41,76,46,88,54,107,62,120,48,133,38,136,31,136,16,151,16,162,14,169,3,181,4,188,10,200,2,218,6,234,19,238,24,247,30,255,36,259,41,264,48,273,54,280,61,286,68,286,75,296,79,306,84,311,90,311,99,310,108,307,117,306,126,308,133,315,140,325,145,331,152,336,157,343,163,352,164,359,165,365,166,372,172,378,181,385,185,388,193,393,199,400,202,408,204,415,205,423,208,429,211,437,217,443,221,450,225,459,228,467,232,475,234,483,238,489,243,494,247,501,246,510,247,518,251,522,258,528,263,533,272,533,280,536,288,537,297,537,310,537,321,537,332,537,340,536,352,536,363,531,369,526,376,519,377,515,384,515,392,512,398,509,408,504,417,500,425,491,434,485,438,481,442,474,447,464,447,457,440,443,427,432,426,424,430,412,429,401,429,392,429,384,430,379,435,371,443,359,438,348,441,343,448,335,453,321,459,313,461,304,463,297,467,287,468,281,468,272,468,264,464,255,466,247,471,238,473,231,472,221,472,215,472,208,472,201,481,196,489,190,498,183,502,175,509,163,510,154,510,145,506,149,493,151,476,146,466,148,448,153,437,142,434,131,429,131,415,114,403,107,392,112,378,106,369,112,357,113,343,108,330,94,318,82,303,72,293,68,278,66,266,73,263,72,250,67,243,62,226,59,209,57,191,62,180,59,171,50,169,38,165,34,152,40,144,36,133,32,122,20,121,10,117,5,100,7,87",
    },
    {
        id:5,
        informate: {
            territory: "3789 ք/մ",
            agricultrual_land: "2200 հեկտար",
            total_population: "282000",
            urban: "160000 (57%)",
            rural: "122000 (43%)",
            total_workforce: "170000 (60%)",
            employed: "95000 (56%)",
            average_salary: "170000 Դրամ",
            specialization: "Արդյունաբերություն",
            success_case: "Անասնապահություն",
        },
        main_part: {
            weather: "Չոր կլիմա",
            region_center_title: "Վանաձոր",
            average_prices: "Միջին գիները մատչելի են",
            Georgia: "130 կմ",
            Yerevan: "120 կմ",
            Iran: "250 կմ",
        },
        class_name:"lori",
        img:"lori.png",
        img_active:"lori-active.png",
        coords:"281,37,288,10,306,13,322,13,324,22,340,20,341,31,348,23,366,22,370,17,376,24,390,24,402,32,414,31,413,42,406,46,405,64,409,71,407,81,425,85,430,97,436,102,436,110,430,111,422,121,416,120,399,133,391,133,379,122,360,150,372,163,384,174,402,168,409,176,410,191,399,211,403,221,399,230,399,243,389,257,370,258,362,264,340,276,353,282,357,297,363,296,364,303,369,314,365,327,363,340,332,339,315,332,308,334,294,330,272,317,256,327,242,315,216,324,198,325,194,311,170,303,138,295,133,304,118,309,100,298,98,291,85,294,79,285,72,292,56,293,50,268,31,269,26,254,17,238,30,207,52,209,60,204,57,190,68,182,74,164,40,158,39,152,48,143,48,133,27,119,27,110,14,106,2,98,5,53,35,37,51,38,61,32,66,39,93,38,103,14,103,5,116,11,131,13,144,24,162,23,171,30,173,17,180,14,193,20,205,31,223,38,228,44,243,37,254,19,260,19,260,35,279,29",
    },
    {
        id:6,
        informate: {
            territory: "2089 ք/մ",
            agricultrual_land: "1800 հեկտար",
            total_population: "251000",
            urban: "140000 (56%)",
            rural: "111000 (44%)",
            total_workforce: "160000 (64%)",
            employed: "90000 (56%)",
            average_salary: "180000 Դրամ",
            specialization: "Շինարարություն",
            success_case: "Զբոսաշրջություն",
        },
        main_part: {
            weather: "Բարենպաստ կլիմա",
            region_center_title: "Հրազդան",
            average_prices: "Միջին գիները մատչելի են",
            Georgia: "140 կմ",
            Yerevan: "60 կմ",
            Iran: "280 կմ",
        },
        class_name:"kotayq",
        img:"kotayq.png",
        img_active:"kotayq-active.png", coords:"89,5,106,15,120,19,131,18,148,24,161,21,172,25,184,31,189,42,194,51,190,64,189,73,190,81,193,89,209,93,215,102,221,112,222,124,221,132,224,137,235,144,240,150,242,163,242,173,245,185,247,202,249,214,256,225,256,235,255,249,253,260,262,270,272,279,279,288,284,292,284,339,274,331,264,336,254,336,241,340,228,348,217,349,200,354,190,355,173,362,96,362,90,353,80,350,72,343,69,331,72,320,70,304,64,296,53,299,42,303,34,301,21,302,12,302,1,297,0,274,0,220,10,220,21,220,21,205,28,190,36,182,47,175,53,167,48,162,51,140,51,121,60,116,59,103,69,97,67,87,67,78,59,71,48,76,38,74,26,72,25,61,19,52,9,52,8,36,6,15,15,11,30,6,42,3,58,1,65,12,74,3",
    },
    {
        id:7,
        name: "Շիրակ",
        informate: {
            territory: "2680 ք/մ",
            agricultrual_land: "216882 հեկտար",
            total_population: "231356",
            urban: "125570 (58%)",
            rural: "95795 (42%)",
            total_workforce: "138800 (81%)",
            employed: "85430 (36%)",
            average_salary: "230$",
            specialization: "Արդյունաբերություն",
            success_case: "Անասնապահություն",
        },
        main_part: {
            weather: "Բարենպաստ կլիմա",
            region_center_title: "Գյումրի",
            average_prices: "Միջին գիները մատչելի են",
            Georgia: "46 կմ",
            Yerevan: "118 կմ",
            Iran: "490 կմ",
        },
        class_name:"shirak",
        img:"shirak.png",
        img_active:"shirak-active.png",
        coords:"136,41,142,35,155,23,169,14,181,10,195,11,205,6,225,5,229,11,227,24,226,38,225,55,235,61,243,63,251,69,250,76,264,87,272,89,272,107,263,116,291,122,298,122,292,135,291,144,281,151,286,160,286,167,278,166,274,171,255,169,249,172,241,197,249,208,249,220,254,224,271,223,277,236,277,247,288,249,294,240,301,240,307,250,308,261,298,273,294,286,279,296,276,303,287,317,288,329,315,332,313,357,307,362,313,373,322,378,321,386,308,398,292,404,284,414,274,414,253,423,244,417,245,403,235,400,234,389,213,393,212,403,203,401,188,404,182,398,173,398,162,395,141,382,140,393,111,394,104,402,105,422,83,425,82,439,72,439,68,430,50,414,41,410,40,402,46,396,51,387,75,378,81,378,78,369,86,371,83,356,95,351,94,345,101,343,106,330,111,327,117,313,117,298,130,290,130,275,127,265,132,262,124,242,119,224,112,206,101,195,102,183,99,165,105,161,98,155,100,143,86,130,68,115,59,110,51,109,34,97,24,96,16,90,14,66,8,57,3,52,9,32,26,29,31,24,42,22,53,18,69,22,69,28,87,28,100,24,110,27,121,33",
    },
    {
        id:8,
        name: "Սյունիք",
        informate: {
            territory: "4500 ք/մ",
            agricultrual_land: "3000 հեկտար",
            total_population: "145000",
            urban: "85000 (59%)",
            rural: "60000 (41%)",
            total_workforce: "90000 (62%)",
            employed: "55000 (61%)",
            average_salary: "200000 Դրամ",
            specialization: "Հանքարդյունաբերություն",
            success_case: "Էկոտուրիզմ",
        },
        main_part: {
            weather: "Բարենպաստ կլիմա",
            region_center_title: "Կապան",
            average_prices: "Հողամասեր մատչելի են",
            Georgia: "350 կմ",
            Yerevan: "250 կմ",
            Iran: "120 կմ",
        },
        class_name:"syuniq",
        img:"syuniq.png",
        img_active:"syuniq-active.png",
        coords:"54,4,65,5,73,10,83,18,93,23,104,26,115,33,128,34,140,37,148,45,158,48,163,58,173,68,180,77,185,86,192,97,202,99,211,107,219,113,225,123,229,134,237,137,251,136,260,129,273,128,284,120,297,120,308,119,318,126,328,128,339,134,341,147,353,149,365,149,379,149,392,153,402,159,408,169,416,183,416,193,412,202,404,203,395,203,387,203,393,213,395,222,397,234,389,239,379,242,366,243,357,249,342,255,334,261,340,275,349,287,360,282,380,287,390,299,396,310,401,323,409,333,414,345,428,345,434,352,434,384,428,388,421,390,414,400,406,407,396,412,389,418,376,406,382,421,389,426,396,434,398,445,404,453,405,466,406,480,405,492,403,504,401,515,397,522,400,535,407,552,407,564,402,577,394,586,380,590,371,580,359,576,346,580,332,577,318,572,307,565,297,573,286,579,276,583,266,587,260,591,254,599,204,599,204,584,208,574,213,559,203,548,199,531,195,513,191,491,180,480,176,457,159,448,152,435,157,424,146,415,147,402,140,383,137,363,146,352,144,332,127,332,118,321,107,313,97,310,90,301,76,295,61,295,51,288,52,270,56,253,65,244,72,239,69,229,61,223,64,209,60,195,55,181,44,170,32,163,23,158,7,156,6,143,13,132,13,114,20,96,12,78,8,65,15,53,27,41,34,27,42,12",
    },
    {
        id:9,
        name: "Վայոց Ձոր",
        informate: {
            territory: "2428 ք/մ",
            agricultrual_land: "1300 հեկտար",
            total_population: "55000",
            urban: "25000 (45%)",
            rural: "30000 (55%)",
            total_workforce: "35000 (64%)",
            employed: "20000 (57%)",
            average_salary: "170000 Դրամ",
            specialization: "Գյուղատնտեսություն",
            success_case: "Ագրոտուրիզմ",
        },
        main_part: {
            weather: "Չոր կլիմա",
            region_center_title: "Եղեգնաձոր",
            average_prices: "Հողամասեր մատչելի են",
            Georgia: "220 կմ",
            Yerevan: "110 կմ",
            Iran: "180 կմ",
        },
        class_name:"vayoc-dzor",
        img:"vayoc-dzor.png",
        img_active:"vayoc-dzor-active.png",
        coords:"229,3,238,10,242,20,248,27,265,25,272,27,282,27,291,35,300,41,331,40,339,50,340,64,340,80,340,105,334,106,326,114,325,120,319,129,313,134,310,139,304,147,302,159,304,167,308,175,310,185,307,198,305,211,303,222,299,228,297,241,295,255,287,258,281,264,271,269,263,276,252,278,243,278,235,281,229,287,223,292,219,299,214,308,161,308,154,301,146,295,139,292,129,294,118,290,111,279,103,276,98,265,93,253,87,259,78,262,71,265,59,265,49,263,41,256,37,245,42,231,47,224,48,208,56,200,47,191,39,180,34,172,29,157,13,144,4,135,5,111,16,103,19,85,33,82,45,77,55,66,60,46,71,45,79,39,93,40,106,41,123,38,132,32,144,37,157,35,167,32,179,28,187,25,193,19,202,20,209,10,218,1",
    },
    {
        id:10,
        name: "Երևան",
        informate: {
            territory: "223 ք/մ",
            agricultrual_land: "0 հեկտար",
            total_population: "1075000",
            urban: "100%",
            rural: "0%",
            total_workforce: "700000",
            employed: "500000",
            average_salary: "250000 Դրամ",
            specialization: "Ծառայություններ",
            success_case: "Տուրիզմ",
        },
        main_part: {
            weather: "Չոր կլիմա",
            region_center_title: "Երևան",
            average_prices: "Բարձր գներ",
            Georgia: "200 կմ",
            Yerevan: "0 կմ",
            Iran: "300 կմ",
        },
        class_name:"erevan",
        img:"erevan.png",
        img_active:"erevan-active.png",
        coords:"6,14,15,13,22,12,31,12,39,9,49,7,59,5,65,3,73,0,84,1,92,11,96,19,101,32,101,40,101,48,104,54,104,73,104,82,104,95,102,102,93,107,83,110,24,110,15,97,11,87,3,69,0,55,0,15,3,33,0,19",
    },
    {
        id:11,
        name: "Տավուշ",
        informate: {
            territory: "2704 ք/մ",
            agricultrual_land: "1900 հեկտար",
            total_population: "126000",
            urban: "63000 (50%)",
            rural: "63000 (50%)",
            total_workforce: "82000 (65%)",
            employed: "45000 (55%)",
            average_salary: "150000 Դրամ",
            specialization: "Արդյունաբերություն",
            success_case: "Զբոսաշրջություն",
        },
        main_part: {
            weather: "Բարենպաստ կլիմա",
            region_center_title: "Իջևան",
            average_prices: "Միջին գիները մատչելի են",
            Georgia: "110 կմ",
            Yerevan: "130 կմ",
            Iran: "350 կմ",
        },
        class_name:"tavush",
        img:"tavush.png",
        img_active:"tavush-active.png",
        coords:"107,27,111,22,113,15,120,14,124,8,130,5,136,5,145,7,151,11,159,25,162,30,165,39,163,46,162,56,168,54,174,46,180,46,186,46,195,54,202,62,208,66,217,71,223,74,228,80,231,92,229,100,227,107,220,114,214,119,207,125,212,132,216,136,221,140,225,144,230,149,237,148,247,145,255,147,262,149,269,155,273,160,282,161,288,156,298,153,305,152,317,153,327,159,333,166,331,174,330,180,326,184,334,186,341,191,346,199,351,207,362,213,368,217,375,220,384,225,398,238,398,291,391,298,390,304,387,311,379,316,374,321,366,324,359,325,351,334,343,338,335,338,327,342,319,347,317,357,312,364,306,369,302,380,296,388,288,389,278,389,269,389,262,382,257,374,249,368,240,361,230,355,223,350,213,350,206,349,200,350,193,353,188,360,179,368,173,376,168,384,163,389,156,394,113,394,105,389,95,385,85,384,79,389,65,394,55,394,42,394,26,394,22,387,25,370,28,358,33,349,30,335,23,327,20,315,10,311,5,299,18,294,26,285,37,281,52,280,63,268,65,249,60,235,70,226,72,212,70,204,58,210,45,207,35,197,27,184,23,171,33,165,37,152,46,147,56,152,63,157,76,152,85,144,97,134,91,121,83,119,72,115,68,94,71,75,79,67,75,58,66,57,51,51,41,44,39,29,41,20,43,6,54,4,63,13,69,19,82,19,95,30,89,25,100,33"
    }
];

var regions=[{"id":1,"state_id":1,"name":"\u0531\u0580\u0561\u0563\u0561\u056e\u0578\u057f\u0576","slug":"am","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-19T12:27:50.000000Z","main_part":{"id":1,"parent_id":1,"slug":"am","weather":"\u0532\u0561\u0580\u0565\u056d\u0561\u057c\u0576, \u0570\u0561\u0574\u0565\u0574\u0561\u057f\u0561\u0562\u0561\u0580 \u057f\u0561\u0584 \u0561\u0574\u0561\u057c\u0578\u057e \u0587 \u0579\u0561\u0583\u0561\u057e\u0578\u0580 \u0581\u0578\u0582\u0580\u057f \u0571\u0574\u0565\u057c\u0578\u057e \u056f\u056c\u056b\u0574\u0561\u0575\u056b \u057f\u056b\u057a\u0568 \u0562\u0576\u0578\u0580\u0578\u0577 \u0567 \u0531\u0580\u0561\u0563\u0561\u056e\u0578\u057f\u0576 \u0574\u0561\u0580\u0566\u056b \u0570\u0561\u0580\u0561\u057e\u0561\u0580\u0587\u0574\u057f\u0575\u0561\u0576 \u0570\u0561\u057f\u057e\u0561\u056e\u056b\u0576:","region_center_title":"\u0531\u0577\u057f\u0561\u0580\u0561\u056f","region_center_info":"1.10.33 \u0562\u0561\u056a\u056b\u0576\u0576\u0565\u0580\u0568 \u0576\u0565\u0580\u056f\u0561\u0575\u0561\u0581\u057e\u0561\u056e \u0565\u0576","region_center_other":"\u0570\u0561\u0574\u0561\u0580 \u0578\u057f\u0578\u0580\u0587 \u0576\u0565\u0580\u056f\u0561\u0575\u0561\u0581\u057e\u0561\u056e","average_prices":"\u0544\u0561\u0580\u0566\u056b \u057f\u0561\u0580\u0561\u056e\u0584\u0578\u057e \u0561\u0576\u0581\u0576\u0578\u0582\u0574 \u0565\u0576 \u0570\u0561\u0574\u0561\u057a\u0565\u057f\u0561\u056f\u0561\u0576 \u0576\u0577\u0561\u0576\u0561\u056f\u0578\u0582\u0569\u0575\u0578\u0582\u0576 3 \u0561\u057e\u057f\u0578\u056d\u0573\u0578\u0582\u0572\u056b\u0576\u0565\u0580","average_other":"\u0540\u0576\u0578\u0582\u0574 \u0531\u0577\u057f\u0561\u0580\u0561\u056f\u0568 \u0574\u057f\u0576\u0578\u0582\u0574 \u0567\u0580 \u0544\u0565\u056e \u0540\u0561\u0575\u0584\u056b \u0531\u0575\u0580\u0561\u0580\u0561\u057f\u0575\u0561\u0576 \u0561\u0577\u056d\u0561\u0580\u0570\u056b \u0531\u0580\u0561\u0563\u0561\u056e\u0578\u057f\u0576 \u0563\u0561\u057e\u0561\u057c\u056b \u0574\u0565\u057b","Georgia":"19 \u056f\u0574","Yerevan":"120 \u056f\u0574","Iran":"200 \u056f\u0574","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-22T13:04:55.000000Z"},"informate":{"id":1,"parent_id":1,"slug":"am","territory":"2600 \u0584\u0561\u057c\u0561\u056f\u0578\u0582\u057d\u056b \u056f\/\u0574","agricultrual_land":"2100 \u0570\u0565\u056f\u057f\u0561\u0580","total_population":"315.742","urban":"235,55 (39%)","rural":"158,55 (30%)","total_workforce":"198,55 (20%)","employed":"19,55 (50%)","average_salary":"1 \u0540\u0561\u0575\u057f\u0576\u056b \u0567, \u0578\u0580 \u0568\u0576\u0569\u0565\u0580\u0581\u0578\u0572\u0568, \u056f\u0561\u0580\u0564\u0561\u056c\u0578\u057e \u0570\u0561\u057d\u056f\u0561\u0576\u0561\u056c\u056b \u057f\u0565\u0584\u057d\u057f, \u0579\u056b \u056f\u0561\u0580\u0578\u0572\u0561\u0576\u0561 \u056f\u0565\u0576\u057f\u0580\u0578\u0576\u0561\u0576\u0561\u056c","specialization":"2 \u0540\u0561\u0575\u057f\u0576\u056b \u0567, \u0578\u0580 \u0568\u0576\u0569\u0565\u0580\u0581\u0578\u0572\u0568, \u056f\u0561\u0580\u0564\u0561\u056c\u0578\u057e \u0570\u0561\u057d\u056f\u0561\u0576\u0561\u056c\u056b \u057f\u0565\u0584\u057d\u057f, \u0579\u056b \u056f\u0561\u0580\u0578\u0572\u0561\u0576\u0561 \u056f\u0565\u0576\u057f\u0580\u0578\u0576\u0561\u0576\u0561\u056c","success_case":"3 \u0540\u0561\u0575\u057f\u0576\u056b \u0567, \u0578\u0580 \u0568\u0576\u0569\u0565\u0580\u0581\u0578\u0572\u0568, \u056f\u0561\u0580\u0564\u0561\u056c\u0578\u057e \u0570\u0561\u057d\u056f\u0561\u0576\u0561\u056c\u056b \u057f\u0565\u0584\u057d\u057f, \u0579\u056b \u056f\u0561\u0580\u0578\u0572\u0561\u0576\u0561 \u056f\u0565\u0576\u057f\u0580\u0578\u0576\u0561\u0576\u0561\u056c","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-19T12:27:50.000000Z"}},{"id":2,"state_id":2,"name":"\u0531\u0580\u0561\u0580\u0561\u057f","slug":"am","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-19T12:27:50.000000Z","main_part":{"id":4,"parent_id":2,"slug":"am","weather":"\u0579\u0578\u0580 \u056d\u056b\u057d\u057f \u0581\u0561\u0574\u0561\u0584\u0561\u0575\u056b\u0576\u0579\u0578\u0580 \u0581\u0561\u0574\u0561\u0584\u0561\u0575\u056b\u0576\u0579\u0561\u0583\u0561\u057e\u0578\u0580 \u0581\u0561\u0574\u0561\u0584\u0561\u0575\u056b\u0576\u0562\u0561\u0580\u0565\u056d\u0561\u057c\u0576\u0581\u0578\u0582\u0580\u057f \u056c\u0565\u057c\u0576\u0561\u0575\u056b\u0576\u0571\u0575\u0578\u0582\u0576\u0561\u0574\u0565\u0580\u0571","region_center_title":"\u0531\u0580\u057f\u0561\u0577\u0561\u057f","region_center_info":"\u0531\u0580\u0561\u0580\u0561\u057f\u056b \u0574\u0561\u0580\u0566\u0568 \u0563\u057f\u0576\u057e\u0578\u0582\u0574 \u0567 \u0540\u0561\u0575\u0561\u057d\u057f\u0561\u0576\u056b \u0570\u0561\u0580\u0561\u057e-\u0561\u0580\u0587\u0574\u0578\u0582\u057f\u0584\u0578\u0582\u0574","region_center_other":"\u0540\u0575\u0578\u0582\u057d\u056b\u057d-\u0561\u0580\u0587\u0574\u0578\u0582\u057f\u0584\u056b\u0581 \u057d\u0561\u0570\u0574\u0561\u0576\u0561\u056f\u056b\u0581 \u0567","average_prices":"\u0544\u0561\u0580\u0566\u056b \u057f\u0561\u0580\u0561\u056e\u0584\u0578\u057e \u0561\u0576\u0581\u0576\u0578\u0582\u0574 \u0565\u0576 \u0570\u0561\u0574\u0561\u057a\u0565\u057f\u0561\u056f\u0561\u0576 \u0576\u0577\u0561\u0576\u0561\u056f\u0578\u0582\u0569\u0575\u0578\u0582\u0576 3 \u0561\u057e\u057f\u0578\u056d\u0573\u0578\u0582\u0572\u056b\u0576\u0565\u0580","average_other":"200.8$","Georgia":"124 \u056f\u0574","Yerevan":"100 \u056f\u0574","Iran":"300 \u056f\u0574","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-22T13:04:33.000000Z"},"informate":{"id":34,"parent_id":2,"slug":"am","territory":"2096 \u0584\u0561\u057c\u0561\u056f\u0578\u0582\u057d\u056b \u056f\/\u0574","agricultrual_land":"200 \u0574\u0574 \u0587 1000 \u0570\u0565\u056f\u057f\u0561\u0580","total_population":"915.14","urban":"735.55 (19%)","rural":"548,55 (10%)","total_workforce":"98,55 (70%)","employed":"11,55 (40%)","average_salary":"\u0531\u0580\u0561\u0580\u0561\u057f\u056b \u0574\u0561\u0580\u0566\u056b \u0563\u0565\u057f\u0565\u0580\u0568 \u057a\u0561\u057f\u056f\u0561\u0576\u0578\u0582\u0574 \u0565\u0576 \u0531\u0580\u0561\u0584\u057d\u056b \u0561\u057e\u0561\u0566\u0561\u0576\u056b\u0576\u0589 \u0546\u0580\u0561 \u057f\u0561\u0580\u0561\u056e\u0584\u0578\u057e \u0565\u0576 \u0561\u0576\u0581\u0576\u0578\u0582\u0574 \u0540\u0580\u0561\u0566\u0564\u0561\u0576 \u0563\u0565\u057f\u0576 \u056b\u0580 \u057d\u057f\u0578\u0580\u056b\u0576 \u0570\u0578\u057d\u0561\u0576\u0584\u0578\u057e, \u056b\u057d\u056f \u0531\u0566\u0561\u057f, \u054e\u0565\u0564\u056b \u0587 \u0531\u0580\u0561\u056e\u0578 \u0563\u0565\u057f\u0568\u055d","specialization":"\u0531\u0580\u0561\u0580\u0561\u057f\u056b \u0574\u0561\u0580\u0566\u0568 \u057f\u0576\u057f\u0565\u057d\u0561\u057a\u0565\u057d \u0540\u0561\u0575\u0561\u057d\u057f\u0561\u0576\u056b \u0561\u0574\u0565\u0576\u0561\u0566\u0561\u0580\u0563\u0561\u0581\u0561\u056e \u0574\u0561\u0580\u0566\u0565\u0580\u056b\u0581 \u0567, \u0570\u0561\u057f\u056f\u0561\u057a\u0565\u057d \u056f\u0561\u0580\u0587\u0578\u0580 \u0567 \u0574\u0561\u0580\u0566\u056b \u0563\u0575\u0578\u0582\u0572\u0561\u057f\u0576\u057f\u0565\u057d\u0561\u056f\u0561\u0576 \u0576\u0577\u0561\u0576\u0561\u056f\u0578\u0582\u0569\u0575\u0578\u0582\u0576\u0568","success_case":"\u0531\u0580\u0561\u0580\u0561\u057f\u056b \u0574\u0561\u0580\u0566\u0578\u0582\u0574 \u057f\u0561\u0580\u0565\u056f\u0561\u0576 \u0574\u056b\u057b\u056b\u0576 \u057b\u0565\u0580\u0574\u0561\u057d\u057f\u056b\u0573\u0561\u0576\u0568 \u0581\u0561\u056e\u0580\u0561\u0564\u056b\u0580 \u0587 \u0562\u0561\u0580\u0571\u0580 \u056c\u0565\u057c\u0576\u0561\u0575\u056b\u0576 \u0577\u0580\u057b\u0561\u0576\u0576\u0565\u0580\u056b \u0574\u056b\u057b\u0587 \u057f\u0561\u057f\u0561\u0576\u057e\u0578\u0582\u0574 \u0567 +10 \u00b0C-\u056b \u0587 -2 \u00b0C-\u056b \u0574\u056b\u057b\u0587\u0589 \u0541\u0574\u057c\u0561\u0576\u0576 \u0561\u0576\u0570\u0578\u0572\u0574 \u0565\u0572\u0561\u0576\u0561\u056f\u056b \u057a\u0561\u0575\u0574\u0561\u0576\u0576\u0565\u0580\u0578\u0582\u0574 \u057f\u0565\u0572\u056b \u0567 \u0578\u0582\u0576\u0565\u0576\u0578\u0582\u0574 \u057b\u0565\u0580\u0574\u0561\u057d\u057f\u056b\u0573\u0561\u0576\u0561\u0575\u056b\u0576 \u0577\u0580\u057b\u0561\u0564\u0561\u057d\u0578\u0582\u0569\u0575\u0578\u0582\u0576. \u057d\u0561\u057c\u0576","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-22T13:02:14.000000Z"}},{"id":3,"state_id":3,"name":"\u0531\u0580\u0574\u0561\u057e\u056b\u0580","slug":"am","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-22T13:03:33.000000Z","main_part":{"id":37,"parent_id":3,"slug":"am","weather":null,"region_center_title":"\u0531\u0580\u0574\u0561\u057e\u056b\u0580","region_center_info":"omopo,","region_center_other":null,"average_prices":null,"average_other":null,"Georgia":null,"Yerevan":null,"Iran":null,"created_at":"2020-12-22T13:02:25.000000Z","updated_at":"2020-12-22T13:03:56.000000Z"},"informate":{"id":37,"parent_id":3,"slug":"am","territory":null,"agricultrual_land":"\u0410\u0440\u043c\u0435\u043d\u0438\u044f","total_population":null,"urban":null,"rural":null,"total_workforce":null,"employed":null,"average_salary":null,"specialization":null,"success_case":null,"created_at":"2020-12-22T13:02:25.000000Z","updated_at":"2020-12-22T13:02:46.000000Z"}},{"id":4,"state_id":4,"name":"\u0533\u0565\u0572\u0561\u0580\u0584\u0578\u0582\u0576\u056b\u0584","slug":"am","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-19T12:27:50.000000Z","main_part":null,"informate":null},{"id":5,"state_id":5,"name":"\u053c\u0578\u057c\u056b","slug":"am","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-19T12:27:50.000000Z","main_part":null,"informate":null},{"id":6,"state_id":6,"name":"\u053f\u0578\u057f\u0561\u0575\u0584","slug":"am","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-19T12:27:50.000000Z","main_part":null,"informate":null},{"id":7,"state_id":7,"name":"\u0547\u056b\u0580\u0561\u056f","slug":"am","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-19T12:27:50.000000Z","main_part":null,"informate":null},{"id":8,"state_id":8,"name":"\u054d\u0575\u0578\u0582\u0576\u056b\u0584","slug":"am","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-19T12:27:50.000000Z","main_part":null,"informate":null},{"id":9,"state_id":9,"name":"\u054e\u0561\u0575\u0578\u0581 \u0571\u0578\u0580","slug":"am","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-19T12:27:50.000000Z","main_part":null,"informate":null},{"id":10,"state_id":10,"name":"\u0535\u0580\u0587\u0561\u0576","slug":"am","created_at":"2020-12-19T12:27:50.000000Z","updated_at":"2020-12-19T12:27:50.000000Z","main_part":null,"informate":null},{"id":31,"state_id":11,"name":"\u054f\u0561\u057e\u0578\u0582\u0577","slug":"am","created_at":null,"updated_at":null,"main_part":null,"informate":null}];
console.log(regions)

function createSpan(inner,class_name){
    const span = document.createElement("span");
    span.innerHTML = inner;
    span.id = class_name;
    span.setAttribute("class","region_name region-"+class_name);
    qartez.appendChild(span);
}

for(region in regions){
    createSpan(regions[region].name,region);
}


const general = document.querySelectorAll("area");
let source_active = "png-marzer-active/";
let source = "png-marzer/";


createImg=(obj)=>{
    const image = document.createElement("img");
    Object.assign(image,obj);
    map_part.appendChild(image);
}

createMap = (obj_map,obj_area)=>{
    const map = document.createElement("map");
    Object.assign(map,obj_map);
    const area = document.createElement("area");
    Object.assign(area,obj_area);
    map.appendChild(area);
    map_part.appendChild(map);
}

function info(index){
    region_name.innerHTML = regions[index].name;
    territory.innerHTML = regions[index].informate.territory
    agricultural.innerHTML = regions[index].informate.agricultrual_land;
    population.innerHTML = regions[index].informate.total_population;
    urban.innerHTML = regions[index].informate.urban;
    rural.innerHTML = regions[index].informate.rural;
    workspace.innerHTML = regions[index].informate.total_workforce;
    employed.innerHTML = regions[index].informate.employed;
    salary.innerHTML = regions[index].informate.average_salary;
    success.innerHTML = regions[index].informate.success_case;
    specialization.innerHTML = regions[index].informate.specialization;
    weather.innerHTML = regions[index].main_part.weather;
    region_centre.innerHTML = regions[index].main_part.region_center_title;
    distinations.innerHTML = regions[index].main_part.average_prices;
    georgia.innerHTML = regions[index].main_part.Georgia
    erevan.innerHTML = regions[index].main_part.Yerevan;
    iran.innerHTML = regions[index].main_part.Iran;
}

const marz = document.querySelectorAll(".region_name");

marz.forEach((item,index)=>{
    item.addEventListener("mouseover",function ff(){
        for(b=0;b<marz.length;b++){
            marz[b].style.color = "inherit"
        }
        item.style.color = "#fff";
        let val = marzer[index];
        map_part.innerHTML="";
        createImg({
            src:source_active+val.img_active,
            useMap:"#"+val.class_name,
            className:val.class_name+" translate",
        });
        createMap({name:val.class_name},{
            coords:val.coords,shape:"poly",
        });

        info(index);
    });
});


function ff(){
    marz[6].style.color = "#fff";
    let val = marzer[6];
    map_part.innerHTML="";
    createImg({
        src:source_active+val.img_active,
        useMap:"#"+val.class_name,
        className:val.class_name+" translate",
    });
    createMap({name:val.class_name},{
        coords:val.coords,shape:"poly",
    });

    info(6);
};
ff();